function showTime(){
    var date = new Date();
    var h = date.getHours(); //ตัวกำหนดค่าเวลาชั่วโมง 0 - 23
    var m = date.getMinutes(); //ตัวกำหนดเวลาเป็นนาที 0 - 59
    var s = date.getSeconds(); //ตัวกำหนดเวลาเป็นวินาที 0 - 59
    var session = "AM"; //เวลาในช่วงก่อนเที่ยงวัน
    
    if(h == 0){//โดยการทำงานจะให้เป็น If โดยถ้า h ไปจนถึง 12 ก็คือถึงเที่ยงวัน
        h = 12;
    }
    
    if(h > 12){ //เมื่อเกินเวลาของ h = 12 ก็จะเกิด if โดยถ้า h = h ก็จะทำการ - 12 เพราะเป็นเวลาหลังเที่ยงวัน
        h = h - 12;
        session = "PM"; //เวลาในช่วงหลังเที่ยงวัน
    }
    
    h = (h < 10) ? "0" + h : h;//เมื่อเลขที่จะแสดงมีค่าน้อยกว่า 10 จะเพิ่ม 0 เข้าไปหน้าเลขเสมอ
    m = (m < 10) ? "0" + m : m;//เมื่อเลขที่จะแสดงมีค่าน้อยกว่า 10 จะเพิ่ม 0 เข้าไปหน้าเลขเสมอ
    s = (s < 10) ? "0" + s : s;//เมื่อเลขที่จะแสดงมีค่าน้อยกว่า 10 จะเพิ่ม 0 เข้าไปหน้าเลขเสมอ
    
    var time = h + ":" + m + ":" + s + " " + session; //เป็นการเรียงลำดับของการทำงาน โดยเป็น ชม ต่อด้วย นาที ต่อด้วย วินาที และต่อด้วยตัวกำหนด am และ pm
    document.getElementById("MyClockDisplay").innerText = time;
    document.getElementById("MyClockDisplay").textContent = time;
    
    setTimeout(showTime, 1000);
    
}

showTime();